init.org
#+TITLE: Init
#+AUTHOR: Gopinath Sadasivam
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

* Enabled Config
 :PROPERTIES:
 :header-args: :tangle yes
 :END:
 
** setup default directories

#+BEGIN_SRC emacs-lisp
(setq user-init-file (or load-file-name (buffer-file-name)))
(setq user-emacs-directory (file-name-directory user-init-file))
(setq user-config-directory (concat user-emacs-directory "config/"))
#+END_SRC

** gc hack and elapsed time logging

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold (* 500 1024 1024))
(eval-when-compile (require 'cl))
(lexical-let ((emacs-start-time (current-time)))
  (add-hook 'emacs-startup-hook
            (lambda ()
              (let ((elapsed (float-time (time-subtract (current-time) emacs-start-time))))
                (message "[Emacs initialized in %.3fs]" elapsed)))))
#+END_SRC

** disable vc hooks

;; disable vc-git crap https://stackoverflow.com/questions/5748814/how-does-one-disable-vc-git-in-emacs
#+BEGIN_SRC emacs-lisp
(setq vc-handled-backends nil)
(eval-after-load "vc" '(remove-hook 'find-file-hook 'vc-find-file-hook))
#+END_SRC

** http-proxy for office network
#+BEGIN_SRC emacs-lisp
(setq url-proxy-services
      '(("no_proxy" . "^\\(localhost\\|10.*\\)")
        ("http" . "15.122.63.30:8080")
        ("https" . "15.122.63.30:8080")))
#+END_SRC
** bootstrap straight.el package manager

#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq straight-use-package-by-default t)
(straight-use-package 'use-package)
#+END_SRC

** init-helper macros

#+BEGIN_SRC emacs-lisp
(defmacro with-system (type &rest body)
  "Evaluate BODY if `system-type' equals TYPE.
   usage: (with-system windows-nt  <code> )
        : (with-system gnu/linux  <code> ) "
  (declare (indent defun))
  `(when (eq system-type ',type)
     ,@body))


(defun load-user-file (file)
  (interactive "f")
  "Load a file in current user's configuration directory"
  (load-file (expand-file-name file user-config-directory)))
#+END_SRC

** loading chain

#+BEGIN_SRC emacs-lisp
(load-user-file "conf-ui.el")
(load-user-file "conf-behaviour.el")
(load-user-file "conf-defaults.el")
(load-user-file "conf-evil.el")
(load-user-file "conf-org.el")
(load-user-file "conf-behaviour-helpers.el")
(load-user-file "conf-workflow-helpers.el")
(load-user-file "conf-programming.el")
(load-user-file "conf-keybindings.el")
(load-user-file "conf-ondemand-toolbox.el")
(load-user-file "conf-experiment.el")

(with-system windows-nt
  (load-user-file "conf-windows.el")
  (setq custom-file (expand-file-name "conf-windows-custom.el" user-config-directory))
  (load custom-file)
  )

(with-system gnu/linux
  (load-user-file "conf-linux.el")
  (setq custom-file (expand-file-name "conf-linux-custom.el" user-config-directory))
  (load custom-file))
#+END_SRC

* Disabled Config
 :PROPERTIES:
 :header-args: :tangle no
 :END:
 
